//
//  对称加密笔记.h
//  01-KVO
//
//  Created by XFB on 2020/4/2.
//  Copyright © 2020 XFB. All rights reserved.
//

#ifndef _______h
#define _______h

DES：数据加密标准（h用的少，因为强度低）
3DES：使用三个密钥，对相同的数据执行三次加密
AES：高级加密标准，苹果的钥匙串访问


AES-ECB：电子密码本：每一块数据，独立加密
最基本的加密模式，相同明文永远加密成相同的密文，无初始向量，容易受到密码本重放攻击，少用

AES-CBC：密码分组链接模式。使用一个密钥和一个初始化向量IV 对数据执行加密
明文加密前要与前面的密文进行异或运算后再加密，因此只要选择不同的初始向量，相同的密文加密后会形成不同的密文
CBC加密是上下文相关的，但明文的错误不会传递到后续分组，如果一个分组丢失，后面分组将全部作废
CBC可以有效的保证密文的完整性，如果一个数据块在传递是丢失或改变，后面的数据将无法正常解密

#endif /* _______h */
